
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 35 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_key_vault_access_policy.cft_jenkins_access
* Update
  * azurerm_automation_account.automation_account
  * module.apim_product[0].azurerm_api_management_product.product
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;auto-pip-stg-courtel-api&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;b2c-test-account&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;b2c-test-account-pwd&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;courtel-certificate&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;gov-uk-notify-api-key&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;pip-team-email&#34;]
  * module.keyvault_apim_secrets.azurerm_key_vault_secret.secret[&#34;apim-subscription-key&#34;]
  * module.keyvault_apim_secrets.azurerm_key_vault_secret.secret[&#34;app-tenant-id&#34;]
  * module.keyvault_redis_secrets.azurerm_key_vault_secret.secret[&#34;REDIS-HOST&#34;]
  * module.keyvault_redis_secrets.azurerm_key_vault_secret.secret[&#34;REDIS-PASSWORD&#34;]
  * module.keyvault_redis_secrets.azurerm_key_vault_secret.secret[&#34;REDIS-PORT&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-java-instrumentation-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-nodejs-instrumentation-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-tenant-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-ad-url&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-admin-url&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-auth-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-config-admin-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-config-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-extension-app-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-tenant-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-token-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-url&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;session-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;shared-storageaccount-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;shared-storageaccount-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;shared-storageaccount-name&#34;]
  * module.kv.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_apim.azurerm_monitor_diagnostic_setting.kv-ds
  * module.redis.azurerm_redis_cache.redis
  * module.sa.azurerm_storage_account.storage_account
* Replace
  * azurerm_key_vault_access_policy.app_mi_access_policy
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects_trigger_once


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_user_assigned_identity.apim_mi will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_user_assigned_identity" "apim_mi"  {
      ~ client_id           = "b6248509-d791-4c33-a5ff-d65afd40809f" -> (known after apply)
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-apim-stg-mi" -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "pip-apim-stg-mi"
      ~ principal_id        = "89b6f7ac-e4d5-477c-970e-65d9e725b398" -> (known after apply)
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          - "application"         = "publishing-information-service"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#publishing-and-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Publishing Information Project"
        } -> (known after apply)
      ~ tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # data.azurerm_user_assigned_identity.app_mi will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_user_assigned_identity" "app_mi"  {
      ~ client_id           = "8d0ead51-3b31-44df-a78e-ada4eea9fe87" -> (known after apply)
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-stg-mi" -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "pip-stg-mi"
      ~ principal_id        = "6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply)
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          - "application"         = "publishing-information-service"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#publishing-and-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Publishing Information Project"
        } -> (known after apply)
      ~ tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_automation_account.automation_account will be updated in-place
  ~ resource "azurerm_automation_account" "automation_account" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa"
        name                          = "pip-ss-stg-aa"
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (9 unchanged attributes hidden)


      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/managed-identities-ptl-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-ptl-mi",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-apim-stg-mi",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-stg-mi",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_access_policy.app_mi_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "app_mi_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg/objectId/6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply)
      ~ object_id               = "6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_access_policy.cft_jenkins_access will be created
  + resource "azurerm_key_vault_access_policy" "cft_jenkins_access" {
      + certificate_permissions = []
      + id                      = (known after apply)
      + key_permissions         = []
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
      + object_id               = "53c88823-b0ec-4b7d-ad10-814df21d880f"
      + secret_permissions      = [
          + "Get",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.apim_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pip-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].data.azurerm_client_config.current will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_client_config" "current"  {
      + client_id       = (known after apply)
      ~ id              = "2022-07-21 13:10:40.200757302 +0000 UTC" -> (known after apply)
      + object_id       = (known after apply)
      ~ subscription_id = "74dacd4f-a248-45bb-a2f0-af700dc4cf68" -> (known after apply)
      ~ tenant_id       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_job_schedule.client_serects must be replaced
-/+ resource "azurerm_automation_job_schedule" "client_serects" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/jobSchedules/dd9e7f4d-eb3a-46d2-889d-65c1fec23e14" -> (known after apply)
      ~ job_schedule_id         = "dd9e7f4d-eb3a-46d2-889d-65c1fec23e14" -> (known after apply)
      ~ parameters              = {
          - "application_id_collection" = "230bec9c-3991-4499-abe3-e58276a7dd99,c3c0f9b5-dfad-4d2b-8f20-4164db16900e"
          - "environment"               = "stg"
          - "key_vault_name"            = "pip-ss-kv-stg"
          - "prefix"                    = "auto"
          - "product"                   = "pip"
          - "source_client_id"          = "f4e06bc2-c8a5-4643-8ce7-85023024abb8"
          - "source_tenant_id"          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
          - "target_application_id"     = "0a68d82c-3643-4316-a8d8-f770a12ade1e"
          - "target_application_secret" = (sensitive)
          - "target_tenant_id"          = "676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        } -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_job_schedule.client_serects_trigger_once must be replaced
-/+ resource "azurerm_automation_job_schedule" "client_serects_trigger_once" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/jobSchedules/f5d5291f-b678-467a-b18c-6f97000b0a05" -> (known after apply)
      ~ job_schedule_id         = "f5d5291f-b678-467a-b18c-6f97000b0a05" -> (known after apply)
      ~ parameters              = {
          - "application_id_collection" = "230bec9c-3991-4499-abe3-e58276a7dd99,c3c0f9b5-dfad-4d2b-8f20-4164db16900e"
          - "environment"               = "stg"
          - "key_vault_name"            = "pip-ss-kv-stg"
          - "prefix"                    = "auto"
          - "product"                   = "pip"
          - "source_client_id"          = "f4e06bc2-c8a5-4643-8ce7-85023024abb8"
          - "source_tenant_id"          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
          - "target_application_id"     = "0a68d82c-3643-4316-a8d8-f770a12ade1e"
          - "target_application_secret" = (sensitive)
          - "target_tenant_id"          = "676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        } -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule"
        name                    = "rotate-client-secrets-schedule"
      ~ start_time              = "2022-07-22T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects_trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects_trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule-single-trigger"
        name                    = "rotate-client-secrets-schedule-single-trigger"
      ~ start_time              = "2022-07-21T13:20:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["auto-pip-stg-courtel-api"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/auto-pip-stg-courtel-api/40393a7183f14b2685f64ce9994390b9"
        name                    = "auto-pip-stg-courtel-api"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["b2c-test-account"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-test-account/6dafcdbd18b8419381b3ee0d2f8a36c5"
        name                    = "b2c-test-account"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["b2c-test-account-pwd"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-test-account-pwd/9371ea87cabe441782b511a5918769e2"
        name                    = "b2c-test-account-pwd"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["courtel-certificate"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/courtel-certificate/2f7cbaa198ec4b35b517424f0aa42f6b"
        name                    = "courtel-certificate"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["gov-uk-notify-api-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/gov-uk-notify-api-key/4a1979f038844138957349afc5c54dcb"
        name                    = "gov-uk-notify-api-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["pip-team-email"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/pip-team-email/bcdf208071594844b54d4a3a0d154fd6"
        name                    = "pip-team-email"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_apim_secrets.azurerm_key_vault_secret.secret["apim-subscription-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-apim-kv-stg.vault.azure.net/secrets/apim-subscription-key/9dd7383fa5e84859b0ba09de2a1404e5"
        name                    = "apim-subscription-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "APIM"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_apim_secrets.azurerm_key_vault_secret.secret["app-tenant-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-apim-kv-stg.vault.azure.net/secrets/app-tenant-id/010d13fc42854dc5b551869c94d3f336"
        name                    = "app-tenant-id"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_redis_secrets.azurerm_key_vault_secret.secret["REDIS-HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/REDIS-HOST/c27e917eb10e421b9ac745fbe57d6ed8"
        name                    = "REDIS-HOST"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Redis"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_redis_secrets.azurerm_key_vault_secret.secret["REDIS-PASSWORD"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/REDIS-PASSWORD/aad5e321e9454fde8b094dcfa6dbf692"
        name                    = "REDIS-PASSWORD"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Redis"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_redis_secrets.azurerm_key_vault_secret.secret["REDIS-PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/REDIS-PORT/46a975c97feb4ef4a5a6c43e044599f6"
        name                    = "REDIS-PORT"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Redis"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-insights-java-instrumentation-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/app-insights-java-instrumentation-key/d5ed46485fc24862ac8060acf4e5dda0"
        name                    = "app-insights-java-instrumentation-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "App Insights"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-insights-nodejs-instrumentation-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/app-insights-nodejs-instrumentation-key/a5c761a9ef42455c9e1ce038fe0864df"
        name                    = "app-insights-nodejs-instrumentation-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "App Insights"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-tenant-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/app-tenant-id/6e75884757794cc5b6739353b7f0499a"
        name                    = "app-tenant-id"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-ad-url"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-ad-url/393424f8773241fe98a1be70736818b9"
        name                    = "b2c-ad-url"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-admin-url"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-admin-url/8e6dde85b50a4d16853643cdcf299ff3"
        name                    = "b2c-admin-url"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-auth-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-auth-endpoint/5a11d3a5a21f4285962e13216c4bb605"
        name                    = "b2c-auth-endpoint"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-config-admin-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-config-admin-endpoint/51386e906269465da6b4663bbc76a227"
        name                    = "b2c-config-admin-endpoint"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-config-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-config-endpoint/4b8816cc89174ea5a5340362d401419e"
        name                    = "b2c-config-endpoint"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-extension-app-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-extension-app-id/1f338cfb15a44dde8c9edceaf00405ae"
        name                    = "b2c-extension-app-id"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-tenant-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-tenant-id/0a88f286fefb4ecdb9134a323b7a55bc"
        name                    = "b2c-tenant-id"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-token-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-token-endpoint/6bdeecbdd6e3403090cc949f5c72d9b4"
        name                    = "b2c-token-endpoint"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-url"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-url/13887feb82b94246a9343877dacb52d6"
        name                    = "b2c-url"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["session-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/session-key/87a32fee4d2640c087c224a85291a2fd"
        name                    = "session-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "purpose"             = "b2c-session"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["shared-storageaccount-connection-string"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/shared-storageaccount-connection-string/f4c0b02ffdf84eeeb6ea24e78f2f40a4"
        name                    = "shared-storageaccount-connection-string"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["shared-storageaccount-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/shared-storageaccount-key/2a694c11a4814948bf6f093be1a08933"
        name                    = "shared-storageaccount-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["shared-storageaccount-name"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/shared-storageaccount-name/c47855dfbfdf4acbb028628fc6cd6cd5"
        name                    = "shared-storageaccount-name"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (6 unchanged attributes hidden)
    }

  # module.kv.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg|pip-ss-kv-stg"
        name                       = "pip-ss-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.kv_apim.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg|pip-ss-apim-kv-stg"
        name                       = "pip-ss-apim-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-cache-stg/providers/Microsoft.Cache/Redis/pip-stg"
        name                          = "pip-stg"
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (23 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved = 642 -> 300
          ~ maxmemory_delta                 = 642 -> 200
          ~ maxmemory_reserved              = 642 -> 200
            # (7 unchanged attributes hidden)
        }
    }

  # module.sa.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Storage/storageAccounts/pipsssastg"
        name                              = "pipsssastg"
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "Deployment Environment" = "stg"
            "Destroy Me"             = "No"
            "Team Contact"           = "#vh-devops"
            "application"            = "publishing-information-service"
            "businessArea"           = "Cross-Cutting"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#publishing-and-information"
            "environment"            = "staging"
            "managedBy"              = "Future Hearings - Publishing Information Project"
        }
        # (48 unchanged attributes hidden)

      ~ blob_properties {
            # (4 unchanged attributes hidden)


          - cors_rule {
              - allowed_headers    = [
                  - "*",
                ] -> null
              - allowed_methods    = [
                  - "GET",
                  - "OPTIONS",
                ] -> null
              - allowed_origins    = [
                  - "https://staff.pip-frontend.staging.platform.hmcts.net",
                ] -> null
              - exposed_headers    = [
                  - "*",
                ] -> null
              - max_age_in_seconds = 200 -> null
            }
          - cors_rule {
              - allowed_headers    = [
                  - "*",
                ] -> null
              - allowed_methods    = [
                  - "GET",
                  - "OPTIONS",
                ] -> null
              - allowed_origins    = [
                  - "https://sign-in.pip-frontend.staging.platform.hmcts.net",
                ] -> null
              - exposed_headers    = [
                  - "*",
                ] -> null
              - max_age_in_seconds = 200 -> null
            }

            # (5 unchanged blocks hidden)
        }



        # (3 unchanged blocks hidden)
    }

Plan: 4 to add, 35 to change, 3 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.sa.azurerm_storage_account.storage_account has been changed
  ~ resource "azurerm_storage_account" "storage_account" {
      + default_to_oauth_authentication   = false
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Storage/storageAccounts/pipsssastg"
        name                              = "pipsssastg"
      + public_network_access_enabled     = true
        tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "Deployment Environment" = "stg"
            "Destroy Me"             = "No"
            "Team Contact"           = "#vh-devops"
            "application"            = "publishing-information-service"
            "businessArea"           = "Cross-Cutting"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#publishing-and-information"
            "environment"            = "staging"
            "managedBy"              = "Future Hearings - Publishing Information Project"
        }
        # (46 unchanged attributes hidden)

      ~ blob_properties {
          + change_feed_retention_in_days = 0
            # (3 unchanged attributes hidden)


          + cors_rule {
              + allowed_headers    = [
                  + "*",
                ]
              + allowed_methods    = [
                  + "GET",
                  + "OPTIONS",
                ]
              + allowed_origins    = [
                  + "https://staff.pip-frontend.staging.platform.hmcts.net",
                ]
              + exposed_headers    = [
                  + "*",
                ]
              + max_age_in_seconds = 200
            }
          + cors_rule {
              + allowed_headers    = [
                  + "*",
                ]
              + allowed_methods    = [
                  + "GET",
                  + "OPTIONS",
                ]
              + allowed_origins    = [
                  + "https://sign-in.pip-frontend.staging.platform.hmcts.net",
                ]
              + exposed_headers    = [
                  + "*",
                ]
              + max_age_in_seconds = 200
            }

            # (5 unchanged blocks hidden)
        }



        # (3 unchanged blocks hidden)
    }
  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_runbook.client_serects has been changed
  ~ resource "azurerm_automation_runbook" "client_serects" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/runbooks/secret-rotation-b2c-apps"
      ~ job_schedule            = [
          + {
              + job_schedule_id = "dd9e7f4d-eb3a-46d2-889d-65c1fec23e14"
              + parameters      = {}
              + run_on          = ""
              + schedule_name   = "rotate-client-secrets-schedule"
            },
        ]
        name                    = "secret-rotation-b2c-apps"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (8 unchanged attributes hidden)
    }
  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["auto-pip-stg-courtel-api"] has been changed
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/auto-pip-stg-courtel-api/40393a7183f14b2685f64ce9994390b9"
        name                    = "auto-pip-stg-courtel-api"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      ~ value                   = (sensitive value)
      ~ version                 = "40393a7183f14b2685f64ce9994390b9" -> "243d2320e6a745e8afc2fd2039f0729f"
        # (6 unchanged attributes hidden)
    }
  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["courtel-certificate"] has been changed
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/courtel-certificate/2f7cbaa198ec4b35b517424f0aa42f6b"
        name                    = "courtel-certificate"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      ~ value                   = (sensitive value)
      ~ version                 = "2f7cbaa198ec4b35b517424f0aa42f6b" -> "488e716184b74444ba2804306b7322ed"
        # (6 unchanged attributes hidden)
    }
  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["gov-uk-notify-api-key"] has been changed
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/gov-uk-notify-api-key/4a1979f038844138957349afc5c54dcb"
        name                    = "gov-uk-notify-api-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
      ~ version                 = "4a1979f038844138957349afc5c54dcb" -> "4783c301b7da4d29ba3caad8e7e0dfff"
        # (7 unchanged attributes hidden)
    }
  # module.kv.azurerm_key_vault.kv has been changed
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg"
        name                            = "pip-ss-kv-stg"
      + public_network_access_enabled   = true
        tags                            = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.kv.azurerm_monitor_diagnostic_setting.kv-ds has been changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg|pip-ss-kv-stg"
        name                       = "pip-ss-kv-stg"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
    }
  # module.kv_apim.azurerm_key_vault_access_policy.product_team_access_policy has been changed
  ~ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg/objectId/7bde62e7-b39f-487c-95c9-b4c794fdbb96"
      + storage_permissions     = []
        # (6 unchanged attributes hidden)
    }
  # module.kv_apim.azurerm_key_vault.kv has been changed
  ~ resource "azurerm_key_vault" "kv" {
      ~ access_policy                   = [
            # (3 unchanged elements hidden)
            {
                application_id          = ""
                certificate_permissions = []
                key_permissions         = []
                object_id               = "338f0f74-6551-410d-a59a-3aad46cf6bb7"
                secret_permissions      = [
                    "Get",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + application_id          = ""
              + certificate_permissions = [
                  + "Get",
                  + "List",
                ]
              + key_permissions         = [
                  + "Get",
                  + "List",
                ]
              + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + application_id          = ""
              + certificate_permissions = [
                  + "List",
                  + "Update",
                  + "Create",
                  + "Import",
                  + "Delete",
                  + "ManageContacts",
                  + "ManageIssuers",
                  + "GetIssuers",
                  + "ListIssuers",
                  + "SetIssuers",
                  + "DeleteIssuers",
                ]
              + key_permissions         = [
                  + "List",
                  + "Update",
                  + "Create",
                  + "Import",
                  + "Delete",
                ]
              + object_id               = "7bde62e7-b39f-487c-95c9-b4c794fdbb96"
              + secret_permissions      = [
                  + "List",
                  + "Set",
                  + "Delete",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = []
                key_permissions         = []
                object_id               = "6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed"
                secret_permissions      = [
                    "Set",
                    "List",
                    "Get",
                    "Delete",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ]
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg"
        name                            = "pip-ss-apim-kv-stg"
      + public_network_access_enabled   = true
        tags                            = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.kv_apim.azurerm_key_vault_access_policy.developer[0] has been changed
  ~ resource "azurerm_key_vault_access_policy" "developer" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + storage_permissions     = []
        # (6 unchanged attributes hidden)
    }
  # module.kv_apim.azurerm_monitor_diagnostic_setting.kv-ds has been changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg|pip-ss-apim-kv-stg"
        name                       = "pip-ss-apim-kv-stg"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
    }
  # azurerm_automation_account.automation_account has been changed
  ~ resource "azurerm_automation_account" "automation_account" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa"
      + local_authentication_enabled  = true
        name                          = "pip-ss-stg-aa"
      + private_endpoint_connection   = []
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (7 unchanged attributes hidden)

      + encryption {
          + key_source = "Microsoft.Automation"
        }

        # (1 unchanged block hidden)
    }
  # azurerm_key_vault_access_policy.app_mi_access_policy has been changed
  ~ resource "azurerm_key_vault_access_policy" "app_mi_access_policy" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg/objectId/6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed"
      + storage_permissions     = []
        # (6 unchanged attributes hidden)
    }
  # azuread_application.frontend_apps["frontend"] has been changed
  ~ resource "azuread_application" "frontend_apps" {
        id                             = "230bec9c-3991-4499-abe3-e58276a7dd99"
        tags                           = []
        # (15 unchanged attributes hidden)







      ~ web {
          ~ redirect_uris = [
              + "https://localhost:8080/login/admin/return",
              + "https://localhost:8080/media-verification/return",
              + "https://localhost:8080/password-change-confirmation/false",
              + "https://localhost:8080/password-change-confirmation/true",
              - "https://pip-frontend-pr-448.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-449.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-450.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-451.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-452.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-453.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-454.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-455.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-456.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-457.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-458.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-459.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-460.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-461.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-462.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-463.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-464.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-465.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-466.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-467.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-468.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-469.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-470.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-471.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-472.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-473.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-474.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-476.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-489.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-494.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-495.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-496.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-497.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-499.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-500.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-502.dev.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend-pr-502.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-503.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-504.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-505.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-506.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-507.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-508.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-509.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-510.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-511.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-512.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-513.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-514.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-515.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-516.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-517.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-518.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-520.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-521.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-522.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-523.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-524.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-525.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-526.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-527.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-528.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-staging.staging.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend-staging.staging.platform.hmcts.net/media-verification/return",
              + "https://pip-frontend-staging.staging.platform.hmcts.net/password-change-confirmation/false",
              + "https://pip-frontend-staging.staging.platform.hmcts.net/password-change-confirmation/true",
              - "https://pip-frontend.staging.platform.hmcts.net/login",
              + "https://pip-frontend.staging.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend.staging.platform.hmcts.net/media-verification/return",
              + "https://pip-frontend.staging.platform.hmcts.net/password-change-confirmation/false",
              + "https://pip-frontend.staging.platform.hmcts.net/password-change-confirmation/true",
                # (5 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
        # (6 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":69,"Program":"tfcmt","SHA1":"","Vars":{}} -->